{"/en/about/":{"data":{"":"","credits#Credits":"Hextra is designed to be a simple, fast, and flexible theme for building modern static websites. It is especially well-suited for documentation websites but can also be used for various types of sites, such as blogs, portfolios, and more.\nHugo, like Jekyll, is a static site generator. What sets Hugo apart is that it is a single binary, making it easy to install and run on various platforms. It is also extremely fast and reliable, capable of rendering a site with thousands of pages in milliseconds.\nHextra is built with a mindset focused on having a minimal footprint. To get started, no extra dependencies like Node.js packages are required; all you need is a single YAML configuration file, along with your Markdown content. Thus, we can focus on writing quality content instead of setting up tooling.\nCredits Hextra cannot be built without the following tools and inspirations:\nHugo Tailwind CSS Heroicons Nextra Next.js "},"title":"About"},"/en/blog/2020-12-01-r-rmarkdown/":{"data":{"including-plots#Including Plots":"R MarkdownThis is an R Markdown document. Markdown is a simple formatting syntax for authoring HTML, PDF, and MS Word documents. For more details on using R Markdown see http://rmarkdown.rstudio.com.\nYou can embed an R code chunk like this:\nsummary(cars) ## speed dist ## Min. : 4.0 Min. : 2.00 ## 1st Qu.:12.0 1st Qu.: 26.00 ## Median :15.0 Median : 36.00 ## Mean :15.4 Mean : 42.98 ## 3rd Qu.:19.0 3rd Qu.: 56.00 ## Max. :25.0 Max. :120.00 fit \u003c- lm(dist ~ speed, data = cars) fit ## ## Call: ## lm(formula = dist ~ speed, data = cars) ## ## Coefficients: ## (Intercept) speed ## -17.579 3.932 Including PlotsYou can also embed plots. See Figure 1 for example:\npar(mar = c(0, 1, 0, 1)) pie( c(280, 60, 20), c('Sky', 'Sunny side of pyramid', 'Shady side of pyramid'), col = c('#0292D8', '#F7EA39', '#C4B632'), init.angle = -50, border = NA ) Figure 1: A fancy pie chart.","r-markdown#R Markdown":""},"title":"Hello R Markdown"},"/en/monetary-and-exchange-monitor/":{"data":{"":"","inflation-and-prices#Inflation and Prices":"","inflation-breakdown-by-sector#Inflation Breakdown by Sector":"","monetary-aggregates-m1-m2#Monetary Aggregates (M1, M2)":"Target Interest Rate Key indicator of Banco de México’s monetary policy. A high rate generally aims at a restrictive policy to control inflation, while a low rate seeks to stimulate growth.\nInflation and Prices Inflation shows how prices increase over time and affects purchasing power. It is divided into core (stable) and non-core (volatile). It is crucial to monitor spikes in headline inflation and changes in core inflation, as they indicate long-term trends.\nInflation Breakdown by Sector Helps identify which sectors are driving inflation. Significant changes in specific sectors, such as energy or food, may reflect cyclical or supply-side problems.\nMonetary Aggregates (M1, M2) They indicate the amount of money in the economy and available liquidity. Accelerated growth can signal an increase in consumption and investment, but can also cause inflation. Look at changes in M1 and M2 to understand monetary policy.","target-interest-rate#Target Interest Rate":""},"title":"Monetary and Exchange Monitor"}}